html/rust/collection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>集合</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="module.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">集合</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org198b4cf">vector</a>
<ul>
<li><a href="#org535365f">新建 vector</a></li>
<li><a href="#org11d2062">更改 vector</a></li>
<li><a href="#orgc8af17e">丢弃 vector 时也会丢弃其所有元素</a></li>
<li><a href="#org2e98ba2">读取 vector 的元素</a></li>
<li><a href="#org60858a5">遍历 vector 中的元素</a></li>
<li><a href="#org2fed68c">使用枚举来储存多种类型</a></li>
</ul>
</li>
<li><a href="#org3c3f9f8">String</a>
<ul>
<li><a href="#orge5b6b89">什么是字符串</a></li>
<li><a href="#org3c53971">新建字符串</a></li>
<li><a href="#org1e4b443">更改字符串</a>
<ul>
<li><a href="#org6abd7a5">使用 push_str 和 push 附加字符串</a></li>
<li><a href="#org92130c6">使用 + 运算符或 format! 宏拼接字符串</a></li>
</ul>
</li>
<li><a href="#orgae54837">索引字符串</a>
<ul>
<li><a href="#org19a959f">内部实现</a></li>
<li><a href="#org37ebd5f">字节、标量值和字形簇</a></li>
<li><a href="#orga9fa908">字符串 slice</a></li>
</ul>
</li>
<li><a href="#orgde43560">遍历字符串</a></li>
<li><a href="#orgfa0af46">总结</a></li>
</ul>
</li>
<li><a href="#orgd4e4ea2">hashMap</a>
<ul>
<li><a href="#orgc8d07a2">新建一个哈希 map</a></li>
<li><a href="#org75e31ff">哈希 map 和所有权</a></li>
<li><a href="#orgfe421e5">访问哈希 map 中的值</a></li>
<li><a href="#org1be0caa">更新哈希 map</a>
<ul>
<li><a href="#org4c028cf">覆盖一个值</a></li>
<li><a href="#orgd20476f">只在键没有对应值时插入</a></li>
<li><a href="#orgb83ca71">根据旧值更新一个值</a></li>
</ul>
</li>
<li><a href="#org08a1a86">哈希函数</a></li>
</ul>
</li>
<li><a href="#org74ffb76">总结</a></li>
</ul>
</div>
</div>
<p>
Rust 标准库中包含一系列被称为 <span class="underline">集合</span> ，非常有用的 <b>数据结构</b> ：
</p>
<ul class="org-ul">
<li>大部分其他数据类型都代表一个特定的值，不过集合可以 <span class="underline">包含多个值</span></li>
<li>不同于内建的数组和元组类型，这些集合指向的数据是 <span class="underline">储存在堆</span> 上的，这意味着数据的数量不必在编译时就已知，并且还可以随着程序的运行增长或缩小</li>
<li>每种集合都有着不同功能和成本，而根据当前情况选择合适的集合，这是一项始终成长的技能</li>
</ul>

<p>
这一章将详细的了解三个在 Rust 程序中被广泛使用的集合：
</p>
<ol class="org-ol">
<li>vector : 允许 <span class="underline">一个挨着一个</span> 地储存一系列数量可变的值</li>
<li>String: 是一个 <span class="underline">字符</span> 的集合</li>
<li>hashMap: 允许将 <span class="underline">值</span> 与一个特定的 <span class="underline">键</span> 相关联</li>
</ol>

<pre class="example">
  接下来将讨论如何创建和更新 vector、字符串和哈希 map，以及它们有什么特别之处
</pre>
<div id="outline-container-org198b4cf" class="outline-2">
<h2 id="org198b4cf">vector</h2>
<div class="outline-text-2" id="text-org198b4cf">
<p>
第一个类型是 <span class="underline">Vec&lt;T&gt;</span> ，也被称为 vector。vector 允许在一个 <b>单独</b> 的数据结构中储存 <b>多于一个</b> 的值：
</p>
<ul class="org-ul">
<li>在 <b>内存中彼此相邻</b> 地排列所有的值</li>
<li>只能储存 <b>相同类型</b> 的值</li>
</ul>

<pre class="example">
    在拥有一系列项的场景下非常实用，例如文件中的文本行或是购物车中商品的价格
</pre>
</div>
<div id="outline-container-org535365f" class="outline-3">
<h3 id="org535365f">新建 vector</h3>
<div class="outline-text-3" id="text-org535365f">
<p>
为了创建一个新的空 vector，可以调用 <span class="underline">Vec::new</span> 函数，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span>: <span style="color: #98f5ff;">Vec</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; = <span style="color: #98f5ff;">Vec</span>::new();
</pre>
</div>

<p>
注意：这里增加了一个 <span class="underline">类型</span> 注解。因为没有向这个 vector 中插入任何值，Rust 并不知道想要储存什么类型的元素
</p>

<pre class="example">
     这是一个非常重要的点：vector 是用泛型实现的，它可以存放任何类型

     而当 Vec 存放某个特定类型时，那个类型位于尖括号中

     在示例中，v 这个 Vec 将存放 i32 类型的元素
</pre>

<p>
在更实际的代码中，一旦插入值 Rust 就可以推断出想要存放的类型，所以你很少会需要这些类型注解。更常见的做法是使用 <span class="underline">初始值</span> 来创建一个 Vec，而且为了方便 Rust 提供了 <span class="underline">vec!</span> 宏。这个宏会根据 <span class="underline">提供的值</span> 来创建一个新的 Vec。下面新建一个拥有值 1、2 和 3 的 Vec&lt;i32&gt;：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3];
</pre>
</div>

<p>
因为提供了 i32 类型的初始值，Rust 可以推断出 v 的类型是 <span class="underline">Vec&lt;i32&gt;</span> ，因此类型注解就不是必须的。接下来让看看如何修改一个 vector
</p>
</div>
</div>
<div id="outline-container-org11d2062" class="outline-3">
<h3 id="org11d2062">更改 vector</h3>
<div class="outline-text-3" id="text-org11d2062">
<p>
对于新建一个 vector 并向其增加元素，可以使用 <span class="underline">push</span> 方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">v</span> = <span style="color: #98f5ff;">Vec</span>::new();

v.push(5);
v.push(6);
v.push(7);
v.push(8);
</pre>
</div>

<ul class="org-ul">
<li>如果想要能够改变它的值，必须使用 <span class="underline">mut</span> 关键字使其可变</li>
<li>放入其中的所有值都是 <span class="underline">i32</span> 类型的，而且 Rust 也根据数据做出如此判断，所以不需要 Vec&lt;i32&gt; 注解</li>
</ul>

<pre class="example">
     另外除了 push 之外还有一个 pop 方法，它会移除并返回 vector 的最后一个元素
</pre>
</div>
</div>

<div id="outline-container-orgc8af17e" class="outline-3">
<h3 id="orgc8af17e">丢弃 vector 时也会丢弃其所有元素</h3>
<div class="outline-text-3" id="text-orgc8af17e">
<p>
类似于任何其他的 struct，vector 在其 <b>离开作用域时会被释放</b> ，如下面注释： 
</p>

<div class="org-src-container">
<pre class="src src-rust">{
    <span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3, 4];

    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22788;&#29702;&#21464;&#37327; v</span>

} <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&lt;- &#36825;&#37324; v &#31163;&#24320;&#20316;&#29992;&#22495;&#24182;&#34987;&#20002;&#24323;</span>
</pre>
</div>

<pre class="example">
     当 vector 被丢弃时，所有其内容也会被丢弃，这意味着这里它包含的整数将被清理

     这可能看起来非常直观，不过一旦开始使用 vector 元素的引用，情况就变得有些复杂了
</pre>
</div>
</div>

<div id="outline-container-org2e98ba2" class="outline-3">
<h3 id="org2e98ba2">读取 vector 的元素</h3>
<div class="outline-text-3" id="text-org2e98ba2">
<p>
访问 vector 中一个值的两种方式， <span class="underline">索引</span> 语法或者 <span class="underline">get</span> 方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">third</span>: &amp;<span style="color: #98f5ff;">i32</span> = &amp;v[2];
<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The third element is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, third);

<span style="color: #00bfff; font-weight: bold;">match</span> v.get(2) {
    <span style="color: #98f5ff;">Some</span>(third) =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The third element is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, third),
    <span style="color: #98f5ff;">None</span> =&gt; <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"There is no third element."</span>),
}
</pre>
</div>

<p>
这里有两个需要注意的地方：
</p>
<ul class="org-ul">
<li>使用 <span class="underline">索引值 2</span> 来获取 <span class="underline">第三个</span> 元素，索引是从 <span class="underline">0</span> 开始的</li>
<li>两个不同的获取第三个元素的方式分别为：
<ul class="org-ul">
<li>使用 <span class="underline">&amp;</span> 和 <span class="underline">[]</span> 返回一个 <b>引用</b></li>
<li>使用 <span class="underline">get</span> 方法以索引作为参数来返回一个 <b>Option&lt;&amp;T&gt;</b></li>
</ul></li>
</ul>

<pre class="example">
Rust 有两个引用元素的方法的原因：程序可以选择如何处理当索引值在 vector 中没有对应值的情况
</pre>

<p>
如果有一个有五个元素的 vector 接着尝试访问索引为 100 的元素时程序会如何处理，如下所示： 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">does_not_exist</span> = &amp;v[100];
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">does_not_exist</span> = v.get(100);
</pre>
</div>

<p>
当运行这段代码，对于第一个 [] 方法，当引用一个不存在的元素时 Rust 会 <b>造成 panic</b> 
</p>
<pre class="example">
     这个方法更适合当程序认为尝试访问超过 vector 结尾的元素是一个严重错误的情况，这时应该使程序崩溃
</pre>

<p>
当 get 方法被传递了一个数组外的索引时，它不会 panic 而是 <b>返回 None</b> 
</p>

<pre class="example">
     当偶尔出现超过 vector 范围的访问属于正常情况的时候可以考虑使用它，接着代码可以有处理 Some(&amp;element) 或 None 的逻辑

     例如 索引可能来源于用户输入的数字。如果它们不慎输入了一个过大的数字那么程序就会得到 None 值，可以告诉用户当前 vector 元素的数量并再请求它们输入一个有效的值

     这就比因为输入错误而使程序崩溃要友好的多！
</pre>

<p>
一旦程序获取了一个有效的引用，借用检查器将会执行 <span class="underline">所有权</span> 和 <span class="underline">借用规则</span> 来确保 vector 内容的这个引用和任何其他引用保持有效。当获取了 vector 的 <span class="underline">第一个元素的不可变引用</span> 并尝试在 vector <span class="underline">末尾增加一个元素</span> 的时候，这是行不通的：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[1, 2, 3, 4, 5];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">first</span> = &amp;v[0];

v.push(6);

<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"The first element is: </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, first);
</pre>
</div>

<p>
这时候会有编译报错：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0502]: cannot borrow <span style="color: #fa8072;">`v`</span> as mutable because it is also borrowed as immutable
 --&gt; src/main.rs:7:5
  |
5 |     <span style="color: #f08080;">let</span> first = &amp;v[0];
  |                  - immutable borrow occurs here
6 |
7 |     v.push(6);
  |     ^^^^^^^^^ mutable borrow occurs here
8 |
9 |     println!(<span style="color: #deb887;">"The first element is: {}"</span>, first);
  |                                          ----- immutable borrow later used here
</pre>
</div>

<pre class="example">
     不能这么做的原因是由于 vector 的工作方式：

     在 vector 的结尾增加新元素时，在没有足够空间将所有所有元素依次相邻存放的情况下，可能会要求分配新内存并将老的元素拷贝到新的空间中

     这时，第一个元素的引用就指向了被释放的内存

     借用规则阻止程序陷入这种状况
</pre>
</div>
</div>
