src/rust/collection.org
** 遍历 vector 中的元素 
   如果想要依次访问 vector 中的每一个元素，可以遍历其所有的元素而无需通过索引一次一个的访问。下面展示了如何使用 _for_ 循环来获取 i32 值的 vector 中的每一个元素的 _不可变引用_ 并将其打印：

   #+BEGIN_SRC rust 
  let v = vec![100, 32, 57];
  for i in &v {
      println!("{}", i);
  }
   #+END_SRC 

   也可以遍历可变 vector 的每一个元素的 _可变引用_ 以便能改变他们。下面的 for 循环会给每一个元素加 50：

   #+BEGIN_SRC rust 
  let mut v = vec![100, 32, 57];
  for i in &mut v {
      ,*i += 50;
  }
   #+END_SRC

** 使用枚举来储存多种类型 
   #+BEGIN_EXAMPLE
     vector 只能储存相同类型的值。这是很不方便的；绝对会有需要储存一系列不同类型的值的用例
   #+END_EXAMPLE

   幸运的是， _枚举_ 的成员都被定义为相同的枚举类型，所以当需要在 vector 中储存不同类型值时，可以定义并使用一个枚举

   #+BEGIN_EXAMPLE
     假如想要从电子表格的一行中获取值，而这一行的有些列包含数字，有些包含浮点值，还有些是字符串

     1. 可以定义一个枚举，其成员会存放这些不同类型的值，同时所有这些枚举成员都会被当作相同类型，那个枚举的类型

     2. 接着可以创建一个储存枚举值的 vector，这样最终就能够储存不同类型的值了
   #+END_EXAMPLE

   #+BEGIN_SRC rust 
  enum SpreadsheetCell {
      Int(i32),
      Float(f64),
      Text(String),
  }

  let row = vec![
      SpreadsheetCell::Int(3),
      SpreadsheetCell::Text(String::from("blue")),
      SpreadsheetCell::Float(10.12),
  ];
   #+END_SRC

   Rust 在编译时就必须准确的知道 vector 中类型的原因：
   1. 它需要知道 *储存每个元素* 到底 *需要多少内存*
   2. 可以准确的知道这个 vector 中 *允许什么类型* 
      + 如果 Rust 允许 vector 存放任意类型，那么当对 vector 元素执行操作时一个或多个类型的值就有可能会造成错误
      + 用枚举外加 match 意味着 Rust 能在编译时就保证总是会处理所有可能的情况

   #+BEGIN_EXAMPLE
     如果在编写程序时不能确切无遗地知道运行时会储存进 vector 的所有类型，枚举技术就行不通了。相反，可以使用 trait 对象
   #+END_EXAMPLE

* String 
  #+BEGIN_EXAMPLE
    字符串是新晋 Rustacean 们通常会被困住的领域，这是由于三方面理由的结合：
    1. Rust 倾向于确保暴露出可能的错误
    2. 字符串是比很多程序员所想象的要更为复杂的数据结构
    3. UTF-8

    所有这些要素结合起来对于来自其他语言背景的程序员就可能显得很困难了
  #+END_EXAMPLE

  字符串就是作为 _字节的集合_ 外加一些方法实现的，当这些字节被解释为文本时，这些方法提供了实用的功能：
  + 先会讲述 String 中那些任何集合类型都有的操作，比如 _创建_ 、 _更新_ 和 _读取_
  + 讨论 String 与其他集合不一样的地方，例如由于人和计算机理解 String 数据方式的不同， _索引_ String是很复杂的


** 什么是字符串
   Rust 的核心语言中只有一种字符串类型： *str* ，而 _字符串 slice_ 通常以被 *借用* 的形式出现 _&str_ 

   #+BEGIN_EXAMPLE
     字符串 slice 是一些储存在别处的 UTF-8 编码字符串数据的引用。比如：字符串字面值被储存在程序的二进制输出中
   #+END_EXAMPLE

   称作 _String_ 的类型是由 *标准库* 提供的，而没有写进核心语言部分，它是 _可增长的_ 、 _可变的_ 、 有 _所有权的_ 、 _UTF-8_ 编码的字符串类型

   #+BEGIN_EXAMPLE
     当 Rustacean 们谈到 Rust 的 “字符串”时，它们通常指的是 String 和字符串 slice &str 类型，而不仅仅是其中之一

     虽然本部分内容大多是关于 String 的，不过这两个类型在 Rust 标准库中都被广泛使用，String 和字符串 slice 都是 UTF-8 编码的
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     Rust 标准库中还包含一系列其他字符串类型，比如 OsString、OsStr、CString 和 CStr，相关库 crate 甚至会提供更多储存字符串数据的选择

     看到这些由 String 或是 Str 结尾的名字了吗？这对应着它们提供的所有权和可借用的字符串变体，就像是你之前看到的 String 和 str

     举例而言，这些字符串类型能够以不同的编码，或者内存表现形式上以不同的形式，来存储文本内容
   #+END_EXAMPLE

** 新建字符串
   很多 Vec 可用的操作在 String 中同样可用，从以 _new_ 函数创建字符串开始，如下所示：

   #+BEGIN_SRC rust 
  let mut s = String::new();
   #+END_SRC

   这新建了一个叫做 s 的空的字符串，接着可以向其中装载数据

   #+BEGIN_EXAMPLE
     通常字符串会有初始数据，因为希望一开始就有这个字符串
   #+END_EXAMPLE

   可以使用 _to_string_ 方法，它能用于任何实现了 _Display_ trait 的类型， _字符串字面值_ 也实现了它：

   #+BEGIN_SRC rust 
  let data = "initial contents";

  let s = data.to_string();

  // 该方法也可直接用于字符串字面值：
  let s = "initial contents".to_string();
   #+END_SRC

   也可以使用 _String::from_ 函数来从字符串字面值创建 String。下面的代码等同于使用 to_string : 

   #+BEGIN_SRC rust 
  let s = String::from("initial contents");
   #+END_SRC 

   #+BEGIN_EXAMPLE
     因为字符串应用广泛，这里有很多不同的用于字符串的通用 API 可供选择

     其中一些可能看起来多余，不过都有其用武之地！

     在这个例子中，String::from 和 .to_string 最终做了完全相同的工作，所以如何选择就是风格问题了
   #+END_EXAMPLE

   字符串是 _UTF-8_ 编码的，所以可以包含任何可以正确编码的数据：
   #+BEGIN_SRC rust 
  let hello = String::from("السلام عليكم");
  let hello = String::from("Dobrý den");
  let hello = String::from("Hello");
  let hello = String::from("שָׁלוֹם");
  let hello = String::from("こんにちは");
  let hello = String::from("안녕하세요");
  let hello = String::from("你好");
  let hello = String::from("Olá");
  let hello = String::from("Здравствуйте");
  let hello = String::from("Hola");
   #+END_SRC
   所有这些都是有效的 String 值 
** 更改字符串
   String 的 _大小_ 可以增加，其 _内容_ 也可以改变，就像可以放入更多数据来改变 Vec 的内容一样。另外，可以方便的使用 _+_ *运算符* 或 _format!_ *宏* 来拼接 String 值
