html/rust/collection.html

<div id="outline-container-org60858a5" class="outline-3">
<h3 id="org60858a5">遍历 vector 中的元素</h3>
<div class="outline-text-3" id="text-org60858a5">
<p>
如果想要依次访问 vector 中的每一个元素，可以遍历其所有的元素而无需通过索引一次一个的访问。下面展示了如何使用 <span class="underline">for</span> 循环来获取 i32 值的 vector 中的每一个元素的 <span class="underline">不可变引用</span> 并将其打印：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[100, 32, 57];
<span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">i</span> <span style="color: #00bfff; font-weight: bold;">in</span> &amp;v {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, i);
}
</pre>
</div>

<p>
也可以遍历可变 vector 的每一个元素的 <span class="underline">可变引用</span> 以便能改变他们。下面的 for 循环会给每一个元素加 50：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">v</span> = <span style="color: #ffd700;">vec!</span>[100, 32, 57];
<span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">i</span> <span style="color: #00bfff; font-weight: bold;">in</span> &amp;<span style="color: #00bfff; font-weight: bold;">mut</span> v {
    *i += 50;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fed68c" class="outline-3">
<h3 id="org2fed68c">使用枚举来储存多种类型</h3>
<div class="outline-text-3" id="text-org2fed68c">
<pre class="example">
vector 只能储存相同类型的值。这是很不方便的；绝对会有需要储存一系列不同类型的值的用例
</pre>

<p>
幸运的是， <span class="underline">枚举</span> 的成员都被定义为相同的枚举类型，所以当需要在 vector 中储存不同类型值时，可以定义并使用一个枚举
</p>

<pre class="example">
假如想要从电子表格的一行中获取值，而这一行的有些列包含数字，有些包含浮点值，还有些是字符串

1. 可以定义一个枚举，其成员会存放这些不同类型的值，同时所有这些枚举成员都会被当作相同类型，那个枚举的类型

2. 接着可以创建一个储存枚举值的 vector，这样最终就能够储存不同类型的值了
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">SpreadsheetCell</span> {
    <span style="color: #98f5ff;">Int</span>(<span style="color: #98f5ff;">i32</span>),
    <span style="color: #98f5ff;">Float</span>(<span style="color: #98f5ff;">f64</span>),
    <span style="color: #98f5ff;">Text</span>(<span style="color: #98f5ff;">String</span>),
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">row</span> = <span style="color: #ffd700;">vec!</span>[
    <span style="color: #98f5ff;">SpreadsheetCell</span>::<span style="color: #98f5ff;">Int</span>(3),
    <span style="color: #98f5ff;">SpreadsheetCell</span>::<span style="color: #98f5ff;">Text</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"blue"</span>)),
    <span style="color: #98f5ff;">SpreadsheetCell</span>::<span style="color: #98f5ff;">Float</span>(10.12),
];
</pre>
</div>

<p>
Rust 在编译时就必须准确的知道 vector 中类型的原因：
</p>
<ol class="org-ol">
<li>它需要知道 <b>储存每个元素</b> 到底 <b>需要多少内存</b></li>
<li>可以准确的知道这个 vector 中 <b>允许什么类型</b> 
<ul class="org-ul">
<li>如果 Rust 允许 vector 存放任意类型，那么当对 vector 元素执行操作时一个或多个类型的值就有可能会造成错误</li>
<li>用枚举外加 match 意味着 Rust 能在编译时就保证总是会处理所有可能的情况</li>
</ul></li>
</ol>

<pre class="example">
     如果在编写程序时不能确切无遗地知道运行时会储存进 vector 的所有类型，枚举技术就行不通了。相反，可以使用 trait 对象
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c3f9f8" class="outline-2">
<h2 id="org3c3f9f8">String</h2>
<div class="outline-text-2" id="text-org3c3f9f8">
<pre class="example">
字符串是新晋 Rustacean 们通常会被困住的领域，这是由于三方面理由的结合：
1. Rust 倾向于确保暴露出可能的错误
2. 字符串是比很多程序员所想象的要更为复杂的数据结构
3. UTF-8

所有这些要素结合起来对于来自其他语言背景的程序员就可能显得很困难了
</pre>

<p>
字符串就是作为 <span class="underline">字节的集合</span> 外加一些方法实现的，当这些字节被解释为文本时，这些方法提供了实用的功能：
</p>
<ul class="org-ul">
<li>先会讲述 String 中那些任何集合类型都有的操作，比如 <span class="underline">创建</span> 、 <span class="underline">更新</span> 和 <span class="underline">读取</span></li>
<li>讨论 String 与其他集合不一样的地方，例如由于人和计算机理解 String 数据方式的不同， <span class="underline">索引</span> String是很复杂的</li>
</ul>
</div>


<div id="outline-container-orge5b6b89" class="outline-3">
<h3 id="orge5b6b89">什么是字符串</h3>
<div class="outline-text-3" id="text-orge5b6b89">
<p>
Rust 的核心语言中只有一种字符串类型： <b>str</b> ，而 <span class="underline">字符串 slice</span> 通常以被 <b>借用</b> 的形式出现 <span class="underline">&amp;str</span> 
</p>

<pre class="example">
     字符串 slice 是一些储存在别处的 UTF-8 编码字符串数据的引用。比如：字符串字面值被储存在程序的二进制输出中
</pre>

<p>
称作 <span class="underline">String</span> 的类型是由 <b>标准库</b> 提供的，而没有写进核心语言部分，它是 <span class="underline">可增长的</span> 、 <span class="underline">可变的</span> 、 有 <span class="underline">所有权的</span> 、 <span class="underline">UTF-8</span> 编码的字符串类型
</p>

<pre class="example">
     当 Rustacean 们谈到 Rust 的 “字符串”时，它们通常指的是 String 和字符串 slice &amp;str 类型，而不仅仅是其中之一

     虽然本部分内容大多是关于 String 的，不过这两个类型在 Rust 标准库中都被广泛使用，String 和字符串 slice 都是 UTF-8 编码的
</pre>

<pre class="example">
Rust 标准库中还包含一系列其他字符串类型，比如 OsString、OsStr、CString 和 CStr，相关库 crate 甚至会提供更多储存字符串数据的选择

看到这些由 String 或是 Str 结尾的名字了吗？这对应着它们提供的所有权和可借用的字符串变体，就像是你之前看到的 String 和 str

举例而言，这些字符串类型能够以不同的编码，或者内存表现形式上以不同的形式，来存储文本内容
</pre>
</div>
</div>

<div id="outline-container-org3c53971" class="outline-3">
<h3 id="org3c53971">新建字符串</h3>
<div class="outline-text-3" id="text-org3c53971">
<p>
很多 Vec 可用的操作在 String 中同样可用，从以 <span class="underline">new</span> 函数创建字符串开始，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">s</span> = <span style="color: #98f5ff;">String</span>::new();
</pre>
</div>

<p>
这新建了一个叫做 s 的空的字符串，接着可以向其中装载数据
</p>

<pre class="example">
     通常字符串会有初始数据，因为希望一开始就有这个字符串
</pre>

<p>
可以使用 <span class="underline">to_string</span> 方法，它能用于任何实现了 <span class="underline">Display</span> trait 的类型， <span class="underline">字符串字面值</span> 也实现了它：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">data</span> = <span style="color: #deb887;">"initial contents"</span>;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = data.to_string();

<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35813;&#26041;&#27861;&#20063;&#21487;&#30452;&#25509;&#29992;&#20110;&#23383;&#31526;&#20018;&#23383;&#38754;&#20540;&#65306;</span>
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"initial contents"</span>.to_string();
</pre>
</div>

<p>
也可以使用 <span class="underline">String::from</span> 函数来从字符串字面值创建 String。下面的代码等同于使用 to_string : 
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"initial contents"</span>);
</pre>
</div>

<pre class="example">
     因为字符串应用广泛，这里有很多不同的用于字符串的通用 API 可供选择

     其中一些可能看起来多余，不过都有其用武之地！

     在这个例子中，String::from 和 .to_string 最终做了完全相同的工作，所以如何选择就是风格问题了
</pre>

<p>
字符串是 <span class="underline">UTF-8</span> 编码的，所以可以包含任何可以正确编码的数据：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1610;&#1603;&#1605;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Dobr&#253; den"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Hello"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#1513;&#1464;&#1473;&#1500;&#1493;&#1465;&#1501;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#12371;&#12435;&#12395;&#12385;&#12399;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#50504;&#45397;&#54616;&#49464;&#50836;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#20320;&#22909;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Ol&#225;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Hola"</span>);
</pre>
</div>
<p>
所有这些都是有效的 String 值 
</p>
</div>
</div>
<div id="outline-container-org1e4b443" class="outline-3">
<h3 id="org1e4b443">更改字符串</h3>
<div class="outline-text-3" id="text-org1e4b443">
<p>
String 的 <span class="underline">大小</span> 可以增加，其 <span class="underline">内容</span> 也可以改变，就像可以放入更多数据来改变 Vec 的内容一样。另外，可以方便的使用 <span class="underline">+</span> <b>运算符</b> 或 <span class="underline">format!</span> <b>宏</b> 来拼接 String 值
</p>
</div>
