src/rust/collection.org
*** 使用 push_str 和 push 附加字符串 
    可以通过 _push_str_ 方法来附加字符串 slice，从而使 String 变长：

    #+BEGIN_SRC rust 
  let mut s = String::from("foo");
  s.push_str("bar");
    #+END_SRC

    #+BEGIN_EXAMPLE
    执行这两行代码之后，s 将会包含 foobar
    #+END_EXAMPLE

    push_str 方法采用 _字符串 slice_ ，因为并不需要获取参数的所有权。下面展示了如果将 s2 的内容附加到 s1 之后，自身不能被使用就糟糕了：

    #+BEGIN_SRC rust 
  let mut s1 = String::from("foo");
  let s2 = "bar";
  s1.push_str(s2);
  println!("s2 is {}", s2);
    #+END_SRC

    #+BEGIN_EXAMPLE
      如果 push_str 方法获取了 s2 的所有权，就不能在最后一行打印出其值了

      好在代码如期望的那样工作！
    #+END_EXAMPLE
    push 方法被定义为获取一个 _单独的字符_ 作为参数，并 *附加* 到 String 中。下面展示了使用 push 方法将字母 l 加入 String 的代码：

    #+BEGIN_SRC rust 
  let mut s = String::from("lo");
  s.push('l');
    #+END_SRC

    #+BEGIN_EXAMPLE
    执行这些代码之后，s 将会包含 “lol”
    #+END_EXAMPLE
*** 使用 + 运算符或 format! 宏拼接字符串 
    通常会希望将两个已知的字符串合并在一起。一种办法是像这样使用 _+_ *运算符* ：
    #+BEGIN_SRC rust 
  let s1 = String::from("Hello, ");
  let s2 = String::from("world!");
  let s3 = s1 + &s2; // 注意 s1 被移动了，不能继续使用
    #+END_SRC

    s1 在 *相加后不再有效* 的原因，和为啥要使用 _s2 的引用_ ，都与使用 + 运算符使用了 _add_ 函数有关，这个函数签名看起来像这样：

    #+BEGIN_SRC rust 
  fn add(self, s: &str) -> String {
    #+END_SRC

    #+BEGIN_EXAMPLE
      这并不是标准库中实际的签名；标准库中的 add 使用泛型定义

      这里看到的 add 的签名使用具体类型代替了泛型，这也正是当使用 String 值调用这个方法会发生的
    #+END_EXAMPLE

    + s2 使用了 &: 使用 _第二个字符串的引用_ 与第一个字符串相加。这是因为 add 函数的 s 参数：只能将 &str 和 String 相加，不能将两个 String 值相加
    #+BEGIN_EXAMPLE
      正如 add 的第二个参数所指定的，&s2 的类型是 &String 而不是 &str。那么为什么还能编译呢？ 这是因为 &String 可以被 强转成 &str

      当add函数被调用时，Rust 使用了一个被称为”解引用强制多态“的技术，可以将其理解为它把 &s2 变成了 &s2[..]

      因为 add 没有获取参数的所有权，所以 s2 在这个操作后仍然是有效的 String
    #+END_EXAMPLE

    + 接着发现签名中 _add_ *获取* 了 _self 的所有权_ ，因为 self 没有使用 &
    #+BEGIN_EXAMPLE
      这意味着示例中的 s1 的所有权将被移动到 add 调用中，之后就不再有效

      虽然 let s3 = s1 + &s2; 看起来就像它会复制两个字符串并创建一个新的字符串，而实际上这个语句会获取 s1 的所有权，附加上从 s2 中拷贝的内容，并返回结果的所有权

      换句话说，它看起来好像生成了很多拷贝，不过实际上并没有，因此这个实现比拷贝要更高效
    #+END_EXAMPLE

    如果想要级联多个字符串，+ 的行为就显得笨重了：
    #+BEGIN_SRC rust 
  let s1 = String::from("tic");
  let s2 = String::from("tac");
  let s3 = String::from("toe");

  let s = s1 + "-" + &s2 + "-" + &s3;
    #+END_SRC

    #+BEGIN_EXAMPLE
      这时 s 的内容会是 “tic-tac-toe”

      可是在有这么多 + 和 " 字符的情况下，很难理解具体发生了什么
    #+END_EXAMPLE

    对于更为复杂的字符串链接，可以使用 _format! 宏_ ：

    #+BEGIN_SRC rust 
  let s1 = String::from("tic");
  let s2 = String::from("tac");
  let s3 = String::from("toe");

  let s = format!("{}-{}-{}", s1, s2, s3);
    #+END_SRC

    #+BEGIN_EXAMPLE
      这些代码也会将 s 设置为 “tic-tac-toe”

      format! 与 println! 的工作原理相同，不过不同于将输出打印到屏幕上，它返回一个带有结果内容的 String
    #+END_EXAMPLE

    这个版本就好理解的多，并且 *不会获取任何参数的所有权* 
** 索引字符串
   在很多语言中，通过 _索引_ 来引用字符串中的单独字符是有效且常见的操作。然而在 Rust 中，如果尝试使用索引语法访问 String 的一部分，会出现一个错误：

   #+BEGIN_SRC rust 
  let s1 = String::from("hello");
  let h = s1[0];
   #+END_SRC

   这会产生下面的编译错误：
   #+BEGIN_SRC sh 
  error[E0277]: the type `std::string::String` cannot be indexed by `{integer}`
   --> src/main.rs:3:13
    |
  3 |     let h = s1[0];
    |             ^^^^^ `std::string::String` cannot be indexed by `{integer}`
    |
    = help: the trait `std::ops::Index<{integer}>` is not implemented for `std::string::String`
   #+END_SRC

   错误和提示说明了全部问题：Rust 的字符串不支持索引

   #+BEGIN_EXAMPLE
     那么接下来的问题是，为什么不支持呢？

     为了回答这个问题，必须先聊一聊 Rust 是如何在内存中储存字符串的
   #+END_EXAMPLE
*** 内部实现
    String 是一个 _Vec<u8>_ 的封装。先来看一些正确编码的字符串的例子。首先：
    #+BEGIN_SRC rust 
  let len = String::from("Hola").len();
    #+END_SRC

    #+BEGIN_EXAMPLE
      在这里，len 的值是 4 ，这意味着储存字符串 “Hola” 的 Vec 的长度是四个字节

      这里每一个字母的 UTF-8 编码都占用一个字节
    #+END_EXAMPLE

    那下面这个例子：

    #+BEGIN_SRC rust 
  let len = String::from("Здравствуйте").len();
    #+END_SRC

    #+BEGIN_EXAMPLE
      当问及这个字符是多长的时候有人可能会说是 12。然而，Rust 的回答是 24

      这是使用 UTF-8 编码 “Здравствуйте” 所需要的字节数，而每个 Unicode 标量值需要两个字节存储

      注意：这个字符串中的首字母是西里尔字母的 Ze 而不是阿拉伯数字 3 
    #+END_EXAMPLE

    可见一个字符串字节值的索引并不总是对应一个有效的 Unicode 标量值。作为演示，思考下无效的 Rust 代码：

    #+BEGIN_SRC rust 
  let hello = "Здравствуйте";
  let answer = &hello[0];
    #+END_SRC

    #+BEGIN_EXAMPLE
      answer 的值应该是什么呢？它应该是第一个字符 З 吗？

      当使用 UTF-8 编码时，З 的第一个字节 208，第二个是 151，所以 answer 实际上应该是 208，不过 208 自身并不是一个有效的字母

      返回 208 可不是一个请求字符串第一个字母的人所希望看到的，不过它是 Rust 在字节索引 0 位置所能提供的唯一数据

      用户通常不会想要一个字节值被返回，即便这个字符串只有拉丁字母：即便 &"hello"[0] 是返回字节值的有效代码，它也应当返回 104 而不是 h
    #+END_EXAMPLE
    为了避免返回意外的值并造成不能立刻发现的 bug，Rust 根本不会编译这些代码，并在开发过程中及早杜绝了误会的发生
