html/rust/collection.html
<div id="outline-container-org6abd7a5" class="outline-4">
<h4 id="org6abd7a5">使用 push_str 和 push 附加字符串</h4>
<div class="outline-text-4" id="text-org6abd7a5">
<p>
可以通过 <span class="underline">push_str</span> 方法来附加字符串 slice，从而使 String 变长：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">s</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"foo"</span>);
s.push_str(<span style="color: #deb887;">"bar"</span>);
</pre>
</div>

<pre class="example">
    执行这两行代码之后，s 将会包含 foobar
</pre>

<p>
push_str 方法采用 <span class="underline">字符串 slice</span> ，因为并不需要获取参数的所有权。下面展示了如果将 s2 的内容附加到 s1 之后，自身不能被使用就糟糕了：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">s1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"foo"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s2</span> = <span style="color: #deb887;">"bar"</span>;
s1.push_str(s2);
<span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"s2 is </span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, s2);
</pre>
</div>

<pre class="example">
      如果 push_str 方法获取了 s2 的所有权，就不能在最后一行打印出其值了

      好在代码如期望的那样工作！
</pre>
<p>
push 方法被定义为获取一个 <span class="underline">单独的字符</span> 作为参数，并 <b>附加</b> 到 String 中。下面展示了使用 push 方法将字母 l 加入 String 的代码：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">s</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"lo"</span>);
s.push(<span style="color: #deb887;">'l'</span>);
</pre>
</div>

<pre class="example">
    执行这些代码之后，s 将会包含 “lol”
</pre>
</div>
</div>
<div id="outline-container-org92130c6" class="outline-4">
<h4 id="org92130c6">使用 + 运算符或 format! 宏拼接字符串</h4>
<div class="outline-text-4" id="text-org92130c6">
<p>
通常会希望将两个已知的字符串合并在一起。一种办法是像这样使用 <span class="underline">+</span> <b>运算符</b> ：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Hello, "</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s2</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"world!"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s3</span> = s1 + &amp;s2; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27880;&#24847; s1 &#34987;&#31227;&#21160;&#20102;&#65292;&#19981;&#33021;&#32487;&#32493;&#20351;&#29992;</span>
</pre>
</div>

<p>
s1 在 <b>相加后不再有效</b> 的原因，和为啥要使用 <span class="underline">s2 的引用</span> ，都与使用 + 运算符使用了 <span class="underline">add</span> 函数有关，这个函数签名看起来像这样：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">add</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, <span style="color: #4eee94;">s</span>: &amp;<span style="color: #98f5ff;">str</span>) -&gt; <span style="color: #98f5ff;">String</span> {
</pre>
</div>

<pre class="example">
      这并不是标准库中实际的签名；标准库中的 add 使用泛型定义

      这里看到的 add 的签名使用具体类型代替了泛型，这也正是当使用 String 值调用这个方法会发生的
</pre>

<ul class="org-ul">
<li>s2 使用了 &amp;: 使用 <span class="underline">第二个字符串的引用</span> 与第一个字符串相加。这是因为 add 函数的 s 参数：只能将 &amp;str 和 String 相加，不能将两个 String 值相加</li>
</ul>
<pre class="example">
      正如 add 的第二个参数所指定的，&amp;s2 的类型是 &amp;String 而不是 &amp;str。那么为什么还能编译呢？ 这是因为 &amp;String 可以被 强转成 &amp;str

      当add函数被调用时，Rust 使用了一个被称为”解引用强制多态“的技术，可以将其理解为它把 &amp;s2 变成了 &amp;s2[..]

      因为 add 没有获取参数的所有权，所以 s2 在这个操作后仍然是有效的 String
</pre>

<ul class="org-ul">
<li>接着发现签名中 <span class="underline">add</span> <b>获取</b> 了 <span class="underline">self 的所有权</span> ，因为 self 没有使用 &amp;</li>
</ul>
<pre class="example">
      这意味着示例中的 s1 的所有权将被移动到 add 调用中，之后就不再有效

      虽然 let s3 = s1 + &amp;s2; 看起来就像它会复制两个字符串并创建一个新的字符串，而实际上这个语句会获取 s1 的所有权，附加上从 s2 中拷贝的内容，并返回结果的所有权

      换句话说，它看起来好像生成了很多拷贝，不过实际上并没有，因此这个实现比拷贝要更高效
</pre>

<p>
如果想要级联多个字符串，+ 的行为就显得笨重了：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"tic"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s2</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"tac"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s3</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"toe"</span>);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = s1 + <span style="color: #deb887;">"-"</span> + &amp;s2 + <span style="color: #deb887;">"-"</span> + &amp;s3;
</pre>
</div>

<pre class="example">
      这时 s 的内容会是 “tic-tac-toe”

      可是在有这么多 + 和 " 字符的情况下，很难理解具体发生了什么
</pre>

<p>
对于更为复杂的字符串链接，可以使用 <span class="underline">format! 宏</span> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"tic"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s2</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"tac"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s3</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"toe"</span>);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = <span style="color: #f08080;">format!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">-</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">-</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, s1, s2, s3);
</pre>
</div>

<pre class="example">
这些代码也会将 s 设置为 “tic-tac-toe”

format! 与 println! 的工作原理相同，不过不同于将输出打印到屏幕上，它返回一个带有结果内容的 String
</pre>

<p>
这个版本就好理解的多，并且 <b>不会获取任何参数的所有权</b> 
</p>
</div>
</div>
</div>
<div id="outline-container-orgae54837" class="outline-3">
<h3 id="orgae54837">索引字符串</h3>
<div class="outline-text-3" id="text-orgae54837">
<p>
在很多语言中，通过 <span class="underline">索引</span> 来引用字符串中的单独字符是有效且常见的操作。然而在 Rust 中，如果尝试使用索引语法访问 String 的一部分，会出现一个错误：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s1</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"hello"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">h</span> = s1[0];
</pre>
</div>

<p>
这会产生下面的编译错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0277]: the type <span style="color: #fa8072;">`std::string::String`</span> cannot be indexed by <span style="color: #fa8072;">`{integer}`</span>
 --&gt; src/main.rs:3:13
  |
3 |     <span style="color: #f08080;">let</span> h = s1[0];
  |             ^^^^^ <span style="color: #fa8072;">`std::string::String`</span> cannot be indexed by <span style="color: #fa8072;">`{integer}`</span>
  |
  = help: the trait <span style="color: #fa8072;">`std::ops::Index&lt;{integer}&gt;`</span> is not implemented for <span style="color: #fa8072;">`std::string::String`</span>
</pre>
</div>

<p>
错误和提示说明了全部问题：Rust 的字符串不支持索引
</p>

<pre class="example">
     那么接下来的问题是，为什么不支持呢？

     为了回答这个问题，必须先聊一聊 Rust 是如何在内存中储存字符串的
</pre>
</div>
<div id="outline-container-org19a959f" class="outline-4">
<h4 id="org19a959f">内部实现</h4>
<div class="outline-text-4" id="text-org19a959f">
<p>
String 是一个 <span class="underline">Vec&lt;u8&gt;</span> 的封装。先来看一些正确编码的字符串的例子。首先：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">len</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Hola"</span>).len();
</pre>
</div>

<pre class="example">
      在这里，len 的值是 4 ，这意味着储存字符串 “Hola” 的 Vec 的长度是四个字节

      这里每一个字母的 UTF-8 编码都占用一个字节
</pre>

<p>
那下面这个例子：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">len</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;"</span>).len();
</pre>
</div>

<pre class="example">
      当问及这个字符是多长的时候有人可能会说是 12。然而，Rust 的回答是 24

      这是使用 UTF-8 编码 “Здравствуйте” 所需要的字节数，而每个 Unicode 标量值需要两个字节存储

      注意：这个字符串中的首字母是西里尔字母的 Ze 而不是阿拉伯数字 3 
</pre>

<p>
可见一个字符串字节值的索引并不总是对应一个有效的 Unicode 标量值。作为演示，思考下无效的 Rust 代码：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #deb887;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;"</span>;
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">answer</span> = &amp;hello[0];
</pre>
</div>

<pre class="example">
answer 的值应该是什么呢？它应该是第一个字符 З 吗？

当使用 UTF-8 编码时，З 的第一个字节 208，第二个是 151，所以 answer 实际上应该是 208，不过 208 自身并不是一个有效的字母

返回 208 可不是一个请求字符串第一个字母的人所希望看到的，不过它是 Rust 在字节索引 0 位置所能提供的唯一数据

用户通常不会想要一个字节值被返回，即便这个字符串只有拉丁字母：即便 &amp;"hello"[0] 是返回字节值的有效代码，它也应当返回 104 而不是 h
</pre>
<p>
为了避免返回意外的值并造成不能立刻发现的 bug，Rust 根本不会编译这些代码，并在开发过程中及早杜绝了误会的发生
</p>
</div>
</div>
