src/rust/collection.org
*** 字节、标量值和字形簇
    这引起了关于 UTF-8 的另外一个问题：从 Rust 的角度来讲，事实上有三种相关方式可以理解字符串： 
    + 字节
    + 标量值
    + 字形簇 

    比如这个用梵文书写的印度语单词 “नमस्ते”，最终它储存在 vector 中的 _字节值_ (u8) 看起来像这样：
    #+BEGIN_EXAMPLE
      [224, 164, 168, 224, 164, 174, 224, 164, 184, 224, 165, 141, 224, 164, 164, 224, 165, 135]

      这里有 18 个字节，也就是计算机最终会储存的数据
    #+END_EXAMPLE

    如果从 Unicode _标量值_ 的角度理解它们，也就像 Rust 的 char 类型那样，这些字节看起来像这样：

    #+BEGIN_EXAMPLE
      ['न', 'म', 'स', '्', 'त', 'े']

      这里有六个 char，不过第四个和第六个都不是字母，它们是发音符号本身并没有任何意义
    #+END_EXAMPLE

    最后，如果以 _字形簇_ 的角度理解，就会得到人们所说的构成这个单词的四个字母：
    #+BEGIN_EXAMPLE
      ["न", "म", "स्", "ते"]
    #+END_EXAMPLE

    Rust 提供了多种不同的方式来解释计算机储存的原始字符串数据，这样程序就可以选择它需要的表现方式，而无所谓是何种人类语言

    #+BEGIN_EXAMPLE
      另外 Rust 不允许使用索引获取 String 字符的原因是，索引操作预期总是需要常数时间 (O(1))

      但是对于 String 不可能保证这样的性能，因为 Rust 必须从开头到索引位置遍历来确定有多少有效的字符
    #+END_EXAMPLE
*** 字符串 slice
    #+BEGIN_EXAMPLE
      索引字符串通常是一个坏点子，因为字符串索引应该返回的类型是不明确的：字节值、字符、字形簇或者字符串 slice
    #+END_EXAMPLE
    如果真的希望使用索引创建 _字符串 slice_ 时，Rust 会要求你更明确一些。可以使用 _[]_ 和一个 _range_ 来创建含特定字节的字符串 slice：

    #+BEGIN_SRC rust 
  let hello = "Здравствуйте";

  let s = &hello[0..4];
    #+END_SRC
    s 会是一个 &str，它包含 *字符串的头四个字节* 

    #+BEGIN_EXAMPLE
      早些时候，提到了这些字母都是两个字节长的，所以这意味着 s 将会是 "Зд" 
    #+END_EXAMPLE

    如果获取 _&hello[0..1]_ 则Rust 在 *运行时会 panic* ，就跟访问 vector 中的无效索引时一样：

    #+BEGIN_SRC sh 
  thread 'main' panicked at 'byte index 1 is not a char boundary; it is inside 'З' (bytes 0..2) of `Здравствуйте`', src/libcore/str/mod.rs:2188:4
    #+END_SRC

    #+BEGIN_EXAMPLE
      必须非常小心谨慎的使用这个操作，因为这么做可能会使程序崩溃
    #+END_EXAMPLE
** 遍历字符串
   #+BEGIN_EXAMPLE
   幸运的是，这里还有其他获取字符串元素的方式
   #+END_EXAMPLE

   如果需要操作单独的 Unicode 标量值，最好的选择是使用 _chars_ 方法。对 “नमस्ते” 调用 chars 方法会将其分开并返回六个 char 类型的值，接着就可以遍历其结果来访问每一个元素了：

   #+BEGIN_SRC rust 
  for c in "नमस्ते".chars() {
      println!("{}", c);
  }
   #+END_SRC

   这会打印出如下内容：
   #+BEGIN_EXAMPLE
     न
     म
     स
     ्
     त
     े
   #+END_EXAMPLE

   另外 _bytes_ 方法返回每一个原始字节：

   #+BEGIN_SRC rust 
  for b in "नमस्ते".bytes() {
      println!("{}", b);
  }
   #+END_SRC

   这会打印出：
   #+BEGIN_EXAMPLE
     224
     164
     // --snip--
     165
     135
   #+END_EXAMPLE

   注意：有效的 Unicode 标量值可能会由不止一个字节组成 

   #+BEGIN_EXAMPLE
     从字符串中获取字形簇是很复杂的，所以标准库并没有提供这个功能
   #+END_EXAMPLE
** 总结
   Rust 选择了以 *准确* 的方式处理 String 数据作为所有 Rust 程序的默认行为，这意味着程序员们必须更多的思考如何预先处理 UTF-8 数据

   #+BEGIN_EXAMPLE
     不同的语言选择了不同的向程序员展示其复杂性的方式

     Rust 相比其他语言更多的暴露出了字符串的复杂性，不过也使在开发生命周期后期免于处理涉及非 ASCII 字符的错误
   #+END_EXAMPLE

* hashMap 
  最后介绍的常用集合类型是 *Hashmap* ：
+ _HashMap<K, V>_ 类型储存了一个 _键_ 类型 _K_ 对应一个 _值_ 类型 _V_ 的 *映射*
+ 通过一个 _哈希函数_ 来实现映射，决定如何将键和值放入内存中
  
#+BEGIN_EXAMPLE
  很多编程语言支持这种数据结构，不过通常有不同的名字：哈希、map、对象、哈希表或者关联数组

  哈希 map 可以用于需要任何类型作为键来寻找数据的情况，而不是像 vector 那样通过索引

  例如：在一个游戏中，可以将每个团队的分数记录到哈希 map 中，其中键是队伍的名字而值是每个队伍的分数。给出一个队名，就能得到他们的得分。

  这里会介绍哈希 map 的基本 API，不过还有更多吸引人的功能隐藏于标准库在 HashMap<K, V> 上定义的函数中。请查看标准库文档来了解更多信息。
#+END_EXAMPLE

** 新建一个哈希 map
   可以使用 _new_ 创建一个空的 HashMap，并使用 _insert_ 增加元素：
   
   #+BEGIN_EXAMPLE
   例如：记录两支队伍的分数，分别是蓝队和黄队。蓝队开始有 10 分而黄队开始有 50 分：
   #+END_EXAMPLE
   
   #+BEGIN_SRC rust 
  use std::collections::HashMap;

  let mut scores = HashMap::new();

  scores.insert(String::from("Blue"), 10);
  scores.insert(String::from("Yellow"), 50);
   #+END_SRC
   
   注意：
+ 必须使用 use 导入标准库中集合部分的 HashMap
#+BEGIN_EXAMPLE
  在这三个常用集合中，HashMap 是最不常用的，所以并没有被 prelude 自动引用

  标准库中对 HashMap 的支持也相对较少，例如，并没有内建的构建宏
#+END_EXAMPLE

+ 像 vector 一样，哈希 map 将它们的 *数据储存在堆* 上，这个 HashMap 的键类型是 String 而值类型是 i32
  + 类似于 vector，哈希 map 是 *同质* 的：所有的键必须是相同类型，值也必须都是相同类型
    
另一个构建哈希 map 的方法是使用一个元组的 _vector_ 的 _collect_ 方法，其中每个元组包含一个 _键值对_ :
#+BEGIN_EXAMPLE
  例如，如果队伍的名字和初始分数分别在两个 vector 中，可以使用 collect 方法将这个元组 vector 转换成一个 HashMap
#+END_EXAMPLE

代码如下所示：
#+BEGIN_SRC rust 
  use std::collections::HashMap;

  let teams  = vec![String::from("Blue"), String::from("Yellow")];
  let initial_scores = vec![10, 50];

  let scores: HashMap<_, _> = teams.iter().zip(initial_scores.iter()).collect();
#+END_SRC

+ _zip_ 方法： 创建一个元组的 vector ，比如“蓝队”和“10”
+ _collect_ 方法：可以将数据收集进一系列的集合类型，包括 HashMap
  
#+BEGIN_EXAMPLE
  HashMap<_, _> 类型注解是必要的，因为可能 collect 很多不同的数据结构，而除非显式指定否则 Rust 无从得知你需要的类型

  但是对于键和值的类型参数来说，可以使用下划线占位，而 Rust 能够根据 vector 中数据的类型推断出 HashMap 所包含的类型
#+END_EXAMPLE

** 哈希 map 和所有权
+ 对于像 _i32_ 这样的实现了 Copy trait 的类型，其值可以 *拷贝* 进哈希 map
+ 对于像 _String_ 这样拥有所有权的值，其值将被 *移动* 而哈希 map 会成为 *这些值的所有者* 
  
#+BEGIN_SRC rust 
  use std::collections::HashMap;

  let field_name = String::from("Favorite color");
  let field_value = String::from("Blue");

  let mut map = HashMap::new();
  map.insert(field_name, field_value);
  // 这里 field_name 和 field_value 不再有效，
  // 尝试使用它们看看会出现什么编译错误！
#+END_SRC

#+BEGIN_EXAMPLE
当 insert 调用将 field_name 和 field_value 移动到哈希 map 中后，将不能使用这两个绑定
#+END_EXAMPLE

如果将 _值的引用_ 插入哈希 map，这些值本身将不会被移动进哈希 map。但是这些引用指向的值必须至少在哈希 map 有效时也是有效的

