html/rust/collection.html
<div id="outline-container-org37ebd5f" class="outline-4">
<h4 id="org37ebd5f">字节、标量值和字形簇</h4>
<div class="outline-text-4" id="text-org37ebd5f">
<p>
这引起了关于 UTF-8 的另外一个问题：从 Rust 的角度来讲，事实上有三种相关方式可以理解字符串： 
</p>
<ul class="org-ul">
<li>字节</li>
<li>标量值</li>
<li>字形簇</li>
</ul>

<p>
比如这个用梵文书写的印度语单词 “नमस्ते”，最终它储存在 vector 中的 <span class="underline">字节值</span> (u8) 看起来像这样：
</p>
<pre class="example">
[224, 164, 168, 224, 164, 174, 224, 164, 184, 224, 165, 141, 224, 164, 164, 224, 165, 135]

这里有 18 个字节，也就是计算机最终会储存的数据
</pre>

<p>
如果从 Unicode <span class="underline">标量值</span> 的角度理解它们，也就像 Rust 的 char 类型那样，这些字节看起来像这样：
</p>

<pre class="example">
['न', 'म', 'स', '्', 'त', 'े']

这里有六个 char，不过第四个和第六个都不是字母，它们是发音符号本身并没有任何意义
</pre>

<p>
最后，如果以 <span class="underline">字形簇</span> 的角度理解，就会得到人们所说的构成这个单词的四个字母：
</p>
<pre class="example">
["न", "म", "स्", "ते"]
</pre>

<p>
Rust 提供了多种不同的方式来解释计算机储存的原始字符串数据，这样程序就可以选择它需要的表现方式，而无所谓是何种人类语言
</p>

<pre class="example">
      另外 Rust 不允许使用索引获取 String 字符的原因是，索引操作预期总是需要常数时间 (O(1))

      但是对于 String 不可能保证这样的性能，因为 Rust 必须从开头到索引位置遍历来确定有多少有效的字符
</pre>
</div>
</div>
<div id="outline-container-orga9fa908" class="outline-4">
<h4 id="orga9fa908">字符串 slice</h4>
<div class="outline-text-4" id="text-orga9fa908">
<pre class="example">
      索引字符串通常是一个坏点子，因为字符串索引应该返回的类型是不明确的：字节值、字符、字形簇或者字符串 slice
</pre>
<p>
如果真的希望使用索引创建 <span class="underline">字符串 slice</span> 时，Rust 会要求你更明确一些。可以使用 <span class="underline">[]</span> 和一个 <span class="underline">range</span> 来创建含特定字节的字符串 slice：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">hello</span> = <span style="color: #deb887;">"&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;"</span>;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">s</span> = &amp;hello[0..4];
</pre>
</div>
<p>
s 会是一个 &amp;str，它包含 <b>字符串的头四个字节</b> 
</p>

<pre class="example">
      早些时候，提到了这些字母都是两个字节长的，所以这意味着 s 将会是 "Зд" 
</pre>

<p>
如果获取 <span class="underline">&amp;hello[0..1]</span> 则Rust 在 <b>运行时会 panic</b> ，就跟访问 vector 中的无效索引时一样：
</p>

<div class="org-src-container">
<pre class="src src-sh">thread <span style="color: #deb887;">'main'</span> panicked at <span style="color: #deb887;">'byte index 1 is not a char boundary; it is inside '</span>&#1047;<span style="color: #deb887;">' (bytes 0..2) of `&#1047;&#1076;&#1088;&#1072;&#1074;&#1089;&#1090;&#1074;&#1091;&#1081;&#1090;&#1077;`'</span>, src/libcore/str/mod.rs:2188:4
</pre>
</div>

<pre class="example">
      必须非常小心谨慎的使用这个操作，因为这么做可能会使程序崩溃
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde43560" class="outline-3">
<h3 id="orgde43560">遍历字符串</h3>
<div class="outline-text-3" id="text-orgde43560">
<pre class="example">
   幸运的是，这里还有其他获取字符串元素的方式
</pre>

<p>
如果需要操作单独的 Unicode 标量值，最好的选择是使用 <span class="underline">chars</span> 方法。对 “नमस्ते” 调用 chars 方法会将其分开并返回六个 char 类型的值，接着就可以遍历其结果来访问每一个元素了：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">c</span> <span style="color: #00bfff; font-weight: bold;">in</span> <span style="color: #deb887;">"&#2344;&#2350;&#2360;&#2381;&#2340;&#2375;"</span>.chars() {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, c);
}
</pre>
</div>

<p>
这会打印出如下内容：
</p>
<pre class="example">
 न
 म
 स
 ्
 त
 े
</pre>

<p>
另外 <span class="underline">bytes</span> 方法返回每一个原始字节：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">b</span> <span style="color: #00bfff; font-weight: bold;">in</span> <span style="color: #deb887;">"&#2344;&#2350;&#2360;&#2381;&#2340;&#2375;"</span>.bytes() {
    <span style="color: #f08080;">println!</span>(<span style="color: #deb887;">"</span><span style="color: #deb887; font-style: italic;">{}</span><span style="color: #deb887;">"</span>, b);
}
</pre>
</div>

<p>
这会打印出：
</p>
<pre class="example">
224
164
// --snip--
165
135
</pre>

<p>
注意：有效的 Unicode 标量值可能会由不止一个字节组成 
</p>

<pre class="example">
     从字符串中获取字形簇是很复杂的，所以标准库并没有提供这个功能
</pre>
</div>
</div>
<div id="outline-container-orgfa0af46" class="outline-3">
<h3 id="orgfa0af46">总结</h3>
<div class="outline-text-3" id="text-orgfa0af46">
<p>
Rust 选择了以 <b>准确</b> 的方式处理 String 数据作为所有 Rust 程序的默认行为，这意味着程序员们必须更多的思考如何预先处理 UTF-8 数据
</p>

<pre class="example">
不同的语言选择了不同的向程序员展示其复杂性的方式

Rust 相比其他语言更多的暴露出了字符串的复杂性，不过也使在开发生命周期后期免于处理涉及非 ASCII 字符的错误
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4e4ea2" class="outline-2">
<h2 id="orgd4e4ea2">hashMap</h2>
<div class="outline-text-2" id="text-orgd4e4ea2">
<p>
最后介绍的常用集合类型是 <b>Hashmap</b> ：
</p>
<ul class="org-ul">
<li><span class="underline">HashMap&lt;K, V&gt;</span> 类型储存了一个 <span class="underline">键</span> 类型 <span class="underline">K</span> 对应一个 <span class="underline">值</span> 类型 <span class="underline">V</span> 的 <b>映射</b></li>
<li>通过一个 <span class="underline">哈希函数</span> 来实现映射，决定如何将键和值放入内存中</li>
</ul>

<pre class="example">
  很多编程语言支持这种数据结构，不过通常有不同的名字：哈希、map、对象、哈希表或者关联数组

  哈希 map 可以用于需要任何类型作为键来寻找数据的情况，而不是像 vector 那样通过索引

  例如：在一个游戏中，可以将每个团队的分数记录到哈希 map 中，其中键是队伍的名字而值是每个队伍的分数。给出一个队名，就能得到他们的得分。

  这里会介绍哈希 map 的基本 API，不过还有更多吸引人的功能隐藏于标准库在 HashMap&lt;K, V&gt; 上定义的函数中。请查看标准库文档来了解更多信息。
</pre>
</div>

<div id="outline-container-orgc8d07a2" class="outline-3">
<h3 id="orgc8d07a2">新建一个哈希 map</h3>
<div class="outline-text-3" id="text-orgc8d07a2">
<p>
可以使用 <span class="underline">new</span> 创建一个空的 HashMap，并使用 <span class="underline">insert</span> 增加元素：
</p>

<pre class="example">
   例如：记录两支队伍的分数，分别是蓝队和黄队。蓝队开始有 10 分而黄队开始有 50 分：
</pre>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::<span style="color: #ffd700;">collections</span>::<span style="color: #98f5ff;">HashMap</span>;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">scores</span> = <span style="color: #98f5ff;">HashMap</span>::new();

scores.insert(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Blue"</span>), 10);
scores.insert(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Yellow"</span>), 50);
</pre>
</div>

<p>
注意：
</p>
<ul class="org-ul">
<li>必须使用 use 导入标准库中集合部分的 HashMap</li>
</ul>
<pre class="example">
  在这三个常用集合中，HashMap 是最不常用的，所以并没有被 prelude 自动引用

  标准库中对 HashMap 的支持也相对较少，例如，并没有内建的构建宏
</pre>

<ul class="org-ul">
<li>像 vector 一样，哈希 map 将它们的 <b>数据储存在堆</b> 上，这个 HashMap 的键类型是 String 而值类型是 i32
<ul class="org-ul">
<li>类似于 vector，哈希 map 是 <b>同质</b> 的：所有的键必须是相同类型，值也必须都是相同类型</li>
</ul></li>
</ul>

<p>
另一个构建哈希 map 的方法是使用一个元组的 <span class="underline">vector</span> 的 <span class="underline">collect</span> 方法，其中每个元组包含一个 <span class="underline">键值对</span> :
</p>
<pre class="example">
  例如，如果队伍的名字和初始分数分别在两个 vector 中，可以使用 collect 方法将这个元组 vector 转换成一个 HashMap
</pre>

<p>
代码如下所示：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::<span style="color: #ffd700;">collections</span>::<span style="color: #98f5ff;">HashMap</span>;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">teams</span>  = <span style="color: #ffd700;">vec!</span>[<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Blue"</span>), <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Yellow"</span>)];
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">initial_scores</span> = <span style="color: #ffd700;">vec!</span>[10, 50];

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">scores</span>: <span style="color: #98f5ff;">HashMap</span>&lt;_, _&gt; = teams.iter().zip(initial_scores.iter()).collect();
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">zip</span> 方法： 创建一个元组的 vector ，比如“蓝队”和“10”</li>
<li><span class="underline">collect</span> 方法：可以将数据收集进一系列的集合类型，包括 HashMap</li>
</ul>

<pre class="example">
HashMap&lt;_, _&gt; 类型注解是必要的，因为可能 collect 很多不同的数据结构，而除非显式指定否则 Rust 无从得知你需要的类型

但是对于键和值的类型参数来说，可以使用下划线占位，而 Rust 能够根据 vector 中数据的类型推断出 HashMap 所包含的类型
</pre>
</div>
</div>

<div id="outline-container-org75e31ff" class="outline-3">
<h3 id="org75e31ff">哈希 map 和所有权</h3>
<div class="outline-text-3" id="text-org75e31ff">
<ul class="org-ul">
<li>对于像 <span class="underline">i32</span> 这样的实现了 Copy trait 的类型，其值可以 <b>拷贝</b> 进哈希 map</li>
<li>对于像 <span class="underline">String</span> 这样拥有所有权的值，其值将被 <b>移动</b> 而哈希 map 会成为 <b>这些值的所有者</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">use</span> <span style="color: #ffd700;">std</span>::<span style="color: #ffd700;">collections</span>::<span style="color: #98f5ff;">HashMap</span>;

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">field_name</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Favorite color"</span>);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">field_value</span> = <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"Blue"</span>);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #00bfff; font-weight: bold;">mut</span> <span style="color: #4eee94;">map</span> = <span style="color: #98f5ff;">HashMap</span>::new();
map.insert(field_name, field_value);
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#36825;&#37324; field_name &#21644; field_value &#19981;&#20877;&#26377;&#25928;&#65292;</span>
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23581;&#35797;&#20351;&#29992;&#23427;&#20204;&#30475;&#30475;&#20250;&#20986;&#29616;&#20160;&#20040;&#32534;&#35793;&#38169;&#35823;&#65281;</span>
</pre>
</div>

<pre class="example">
当 insert 调用将 field_name 和 field_value 移动到哈希 map 中后，将不能使用这两个绑定
</pre>

<p>
如果将 <span class="underline">值的引用</span> 插入哈希 map，这些值本身将不会被移动进哈希 map。但是这些引用指向的值必须至少在哈希 map 有效时也是有效的
</p>
</div>
</div>
